--[[ 
           BY ABBAS ALSAIDI          
            WRITER ABBAS             
            Dev@Abbas9_9                 

--]]
do 

function run(msg, matches) 
  return [[ 
📜 ⚡️ANONYMOUSE<>BOT⚡️

➖🔹➖🔹➖🔹➖🔹➖🔹

▫️ م1 :: لعرض الاوامر الرئيسية

▫️ م2 :: لعرض الاوامر الثانوية

▫️ م3 :: لعرض أوامر حماية المجموعة

▫️ م4 :: لعرض الاوامر الاضافية

▫️ م المطور :: لعرض أوامر المطور

➖🔹➖🔹➖🔹➖🔹➖🔹
🍃DEV 1:- @Abbas9_9 🙂🍷
🍃channel : @ABB_96 🙂🍷
]] 

end 

return { 
description = "Help list", 
usage = "Help list", 
patterns = { 
"^(الاوامر)$", 
}, 
run = run 
} 
end
