--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀          BY ABBAS ALSAIDI           ▀▄ ▄▀ 
▀▄ ▄▀            WRITER ABBAS             ▀▄ ▄▀ 
▀▄ ▄▀           Dev@Abbas9_9              ▀▄ ▄▀   
▀▄ ▄▀        ملف الردود = Repaly          ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]] 
do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلو"   --msg 
rs[1] = " هــﮧ✥ـٍہٰٓـ๋͜لاـوات🦀❤️ "    --replaY 

ws[2] = "تشاكي" 
rs[2] = " نـﮧ✥ـٍعٰٓـ๋͜م تفضل🕷❤️ " 

ws[3] = "هلا" 
rs[3] = " هــﮧ✥ـٍہٰٓـ๋͜لاـ بيك🦀❤️ " 

ws[4] = "شلونك" 
rs[4] = " تٰمـہام ⚘║␙ 🎅🏿🐾 وانٓــت ࿐❥🐚💛 " 

ws[5] = "شلونكم"   --msg 
rs[5] = " آلـْ ح ـمـِْدِّ اللّـٰھ وانٓــتــٰـہ ࿐❥ 🌎🌸 "  --reply 

ws[6] = "تمام" 
rs[6] = " دۈۋم يّےـآٱآرب ↜┇✥ 💁🏿‍♂️👅 " 
ws[7] = "دوم" 
rs[7] = " פـبـ⚘ـيبي 💓💧 " 

ws[8] = "تخليني" 
rs[8] = " ؏ راسي🌝🦀 " 

ws[9] = "هلاو" 
rs[9] = " هــﮧ✥ـٍہٰٓـ๋͜لاـوات  حـٰ« ࿐❥ـبي 🐹💧 " 
ws[10] = "🌝" 
rs[10] = " منﮩﮩﮩﮩور🌝🦀 " 

ws[11] = "انجب" 
rs[11] = " صﮩﮩار ستادي🐸🍃 " 

ws[12] = "احبك" 
rs[12] = " פـبـ⚘ـيبي 💓💧 وني هم😻🦀 " 

ws[13] = "اكرهك" 
rs[13] = " ديله شلون اطيق خلقتك اني😾🖖🏿🕷 " 

ws[14] = "تحبني" 
rs[14] = " مادري افڱﮩﮩﮩر🐸💔 " 

ws[15] = "محمد" 
rs[15] = " ڤڍ ﯿتﮩه😻🦀🍃 " 

ws[16] = "حسين" 
rs[16] = " ﯿمه ﯿمه الثكيل ڤڍ ﯿتﮩه😻🦀🍃 " 

ws[17] = "مودي" 
rs[17] = " פـبـ⚘ـيبي 💓💧 هاذ ورده الكروب🙇🏻❤️ " 

ws[18] = "كسمك" 
rs[18] = " مال امك لوردي شايفه🌝👄 " 

ws[19] = "عباس" 
rs[19] = " #تاج راسك مشغول هسه🌝🦀❤️ " 

ws[20] = "🌚" 
rs[20] = " ڤڍ  ﯿت ڝخٲﻣك😻🕷👄 " 

ws[21] = "😐" 
rs[21] = " ﺸبﯿك صۜافن ؏ خالتك😹🙇🏻❤️ " 

ws[22] = "🙄" 
rs[22] = " ؏ينڱ نژله اﺨاف عليك/ﭻ 🙇🏻💚 " 

ws[23] = "😒" 
rs[23] = "شــبيگ •┇✞🐤💦 حـٰ« ࿐❥ـبي 🐹💧 " 

ws[24] = "اريد بوت" 
rs[24] = " تعال هنا🌝👄 @lls_bot " 

ws[25] = "وين المدير" 
rs[25] = " ڸﯿﺸ شتريد🙄💔🍃 " 

ws[26] = "اه" 
rs[26] = "راح افوته واريحك 🐺🍆" 

ws[27] = "باي" 
rs[27] = "وين مولي خلينه بتونسين 🔇🚷" 

ws[28] = "كفو" 
rs[28] = "اله كفو يبو لضلوع اه 😻😹" 

ws[29] = "فرخ" 
rs[29] = "وينه خلي احصره ؟🙊😹" 

ws[30] = "شباب" 
rs[30] = "نعم حبي!!🙇🏿💜"

ws[31] = "حسون"
rs[31] = "فديته لصاك اخ لو بس يخليني😔😹😹💜"

ws[32] = "ام حسين"
rs[32] = "هاي حبيبت سيف ليندك بيه اشكه؟"

ws[33] = "فديت"
rs[33] = "فداك كوني وثنين عيوني 🌝💜"

ws[34] = "خاص"
rs[34] = "اثكل حبي لضل ساحف؟😔😹"

ws[35] = "تعال خاص"
rs[35] = "بله حشوفه صوره يابنيه كلههن زي لخرا🌝😹"

ws[36] = "تعالي خاص"
rs[36] = "اهوو ضل ضل ساحف كبر طمك😔😹❤️"

ws[37] = "زاحف"
rs[37]  = "زاحف ع اختك؟ كضيت عمرك جرجف🌝😹😹🌝كضيت عمرك زحف تره"

ws[38] = "دي"
rs[38] = "خليني احہۣۗبہۣۜۧ😻ہۣۛۖہۣۖۗڱֆ ̮⇣  🌝💔"

ws[39] = "😳"
rs[39] = "ها بس لا شفت خالتك الشكره 😳😹🕷"

ws[40] = "😕"
rs[40] = "تعال اشكيلي اهمومك ليش ضايج 🙁😭💔"

ws[41] = "🚶🏿💔"
rs[41] = "تعال اشكيلي اهمومك ليش ضايج 🙁😭💔"

ws[42] = "غني"
rs[42] = "اي مو كدامك مغني قديم 😒🎋 هوه ﴿↜ انـِۨـۛـِۨـۛـِۨيـُِـٌِہۧۥۛ ֆᵛ͢ᵎᵖ ⌯﴾❥  ربي كامز و تكلي غنيلي 🙄😒🕷 آإرۈحُـ✯ـہ✟  😴أنــ💤ــااااام😴  اشرف تالي وكت يردوني اغني 😒☹️🚶"

ws[43] = "هاي"
rs[43] = "هايہۣۜۧ😻اہۣۖۗتֆ ̮⇣ يروہۣۗحہيۣֆ ﴿  ❁¹°↜إنـِۧـۣۧتِـِۨـۘهہْ ۦ ֆᵛ͢ᵎᵖ ⌯﴾❥ 🎐😽😻"

ws[44] = "بوت"
rs[44] = "اول شي ولد لو بنيه؟ ثاني شي اذا ولد  امشي اطلع بره اي  وذا بنيه حياتي تعاي خاص موضوع حساس عندي😪🌚😹"

ws[45] = "الدنيه شنو"
rs[45] = "كحبه تضحك بس للكواويد يخوي كفو منك ع راسي🙂💜"

ws[46] = "🙂"
rs[46] = "ثكيل علساس هه😪🌚"

ws[47] = "طبعاا"
rs[47] = "#تجراسي والله تحتاج شي؟☹️💜😹"

ws[48] = "منو المطور"
rs[48] = "@li_XxX_il"

ws[49] = "يا فيصل"
rs[49] = "تخليني🐸😹"

ws[50] = "بخير"
rs[50] = "دومك/ج بخير يروحي انته/ي 😻😽"

ws[51] = "شسمك"
rs[51] = "تجراسك وكحبي اسمي تيبارا"

ws[52] = "شنو اسم البوت"
rs[52] = "صكاركم تيبارا"

ws[53] = "افلش"
rs[53] = "حته ارجعك بمك حبي🌝💋"

ws[54] = "منحرف"
rs[54] = "وينه خلي اصادق اخته وكسر عينه😔😹"

ws[55] = "واكف"
rs[55] = "بنلخرا وين واكف😐"

ws[56] = "اريد اكبل"
rs[56] = "شـًٍـًٍوــًٍـًٍفـًٍــًٍـًٍلـًٍلًٍي وياك حديقه ودايح رسمي 🙇🏿💜😹"

ws[57] = "بنيه"
rs[57] = "وينه خلي تجيني واتس نتونس🌝💜"

ws[58] = "لتزحف"
rs[58] = "دعوفه زاحف ع خالتك خلي يستفاد😕😹🙊"

ws[59] = "هم يجي يوم تعوفني"
rs[59] = "لأ يخوي تشه‍ه‍ه‍د الدنيه احبگ؟موت احپگ يلحپيپ💜🍃"

ws[60] = "هينه بمكاني"
rs[60] = "طيز مطيزه عير مفرزه عير يفتر وره الطيز  دبه دهن دبه كريز ابن العاهره ابن الكايمه ابن التشيله وهيه نايمه ابن ام البلاوي امك تشيل حته الخصاوي اخت التبلع ابن الترضع ابن التمص وماتشبع عير يطب وعير يطلع ادري طِيِّﺰ لو مقلع بس انت اصلك ماتشبع"

ws[61] = "اكسر عينه هسه"
rs[61] = "ابن الهايمة ابن الكايمة ابن التمصة وهية نايمة ابن العاهرة السكسية ابن الشرموطة التكعد ع العير وتسوي موطة امك ترجع ع العير بدون مرايات وشايفة العير اكثر من المطهرجي وماخذة وية العير صورة ولاعبة علية جقة شبر اليوم انيجك نيجت القرد واخليك مشمور بالبرد انيجك نيجت الحمار شرط بالليل مو بالنهار انيجك نيجة البعير وانطيك عير ستيل فوتة للاخير واطلع من طيزك خنزير "

ws[62] = "كافي حب"
rs[62] = "صار تاج راسي شوكت متريد انيجهم حاظر اني🙊❤️"

ws[63] = "غنيلي"
rs[63] = "لا تظربني لا تظرب 💃💃 كسرت الخيزارانه💃🎋 صارلي سنه وست اشهر💃💃 من ظربتك وجعانه🤒😹 اه اه"

ws[64] = "مكوم"
rs[64] = "ستادي حكه بيهم كلهم فروخ وكحاب بس يستشرفون وداعتك😞🤘🏿"

ws[65] = "تنح"
rs[65] = "من يصير عندك عود اتنح دي فرخي😸🤘🏿"

ws[66] = "جوني"
rs[66] = "#تجراسنه وحامي اعراضنه ويحب مايا وف يوميه اضرب عليهم 😞💋"

ws[67] = "كلخرا"
rs[67] = "خرا ليترس حلكك/ج ياخرا يابنلخرا خختفووو ابلع😸🙊💋"

ws[68] = "ضوجه"
rs[68] = "باع نغل يكول ضوجه حته لبنات ينتبهن ويزحفلهن ويتنايجون واني اضل احمي هنا شعب خخرا😒💔🤘🏿"

ws[69] = "الدنيه للتهواك تمطر؟"
rs[69] = "كساسه كساسه مطرت عليه بعير شكبر راسه وشكرا😞❤️💋"

ws[70] = "حارة"
rs[70] = "يي كولش 😭🍃🔥"

ws[71] = "خالتك"
rs[71] = " راح اطردك لك 😒"

ws[72] = "اطرد البوت"
rs[72] = " راح ابقة احترمك❤️"

ws[73] = "هه"
rs[73] = " شدتحس"

ws[74] = "شدتحس"
rs[74] = " داحس بيك"

ws[75] = "اكولك"
rs[75] = " لتكول 😐😂"

ws[76] = "اكلك"
rs[76] = " لتكول 😐😂"

ws[78] = "بغداد"
rs[78] = " 😍 فديتهه"

ws[79] = "البصرة"
rs[79] = " اويلي كولهة صاكه  ❤️"

ws[80] = "تركماني"
rs[80] = " والنعم منك❤️"

ws[81] = "يا سورس هذا"
rs[81] = "عبسكه"

ws[83] = "جااو"
rs[83] = " الله وياك ❤️🍃"

ws[85] = "جوعان"
rs[85] = "تعال اكلني 😐😂"

ws[86] = "عطشان"
rs[86] = "روح اشرب مي"

ws[87] = "صايم"
rs[87] = "شسويلك 😐🍃"

ws[88] = "☹️"
rs[88] = "لضوج حبيبي 😢❤️🍃"

ws[89] = "😔"
rs[89] = " ليش الحلو ضايج ❤️🍃"

ws[90] = "فرخ"
rs[90] = " عيبب 😱😱"

ws[93] = "نعال"
rs[93] = " بوجهك 😐😂"

ws[94] = "حروح اسبح"
rs[94] = " واخيراً 😂"

ws[95] = "حروح اغسل"
rs[95] = " واخيراً 😂"

ws[96] = "حروح اطب للحمام"
rs[96] = " واخيراً 😂"

ws[97] = "حبيبتي"
rs[97] = " منو هاي 😱 تخوني 😔☹"

ws[98] = "كبلت"
rs[98] = " بلخير 😂💔"

ws[99] = "البوت عاوي"
rs[99] = " اطردك ؟ 😒"

ws[100] = "منور"
rs[100] = " بنورك حبي 😍🍷"

ws[101] = "حفلش"
rs[101] = " افلش راسك"

ws[102] = "كردي"
rs[102] = "والنعم منك ❤️"

ws[103] = "طفي السبلت"
rs[103] = " تم اطفاء السبلت بنجاح 🌚🍃"

ws[104] = "🌝"
rs[104] = "هه"

ws[105] = "اذن المغرب"
rs[105] = "استحرم 🌚🍃"

ws[106] = "حلو"
rs[106] = "انت الاحلى 🌚❤️"

ws[107] = "احبك"
rs[107] = " اني اكثر 😍🍃"

ws[108] = "😑"
rs[108] = " شبيك 🍃☹"

ws[109] = "😒"
rs[109] = "😐 شبيك كالب وجهك "

ws[110] = "منو تحب"
rs[110] = "خالتك الشكرة"

ws[111] = "باجر العيد"
rs[111] = "كل عام وانت بالف خير حبي 😇❤️"

ws[112] = "فديتج"
rs[112] = "ها  زاحف كمشتك"

ws[113] = "مضغوط"
rs[113] = "دي انضغظ منك ؟ 😂😂"

ws[114] = "فديتك"
rs[114] = "ها  زاحفه كمشتج"


ws[116] = "فديتج"
rs[116] = "ها  زاحف كمشتك"

ws[117] = "شوف خاصك"
rs[117] = "شدازله 😱😨"

ws[118] = "تعال خاص"
rs[118] = "شحسوون 😱"

ws[119] = "خاص "
rs[119] = "شحسوون 😱"

ws[120] = "دخل السبام"
rs[120] = "شحسوون 😱"

ws[121] = "😎"
rs[121] = "يلا عود انته فد نعال 😐🍃"

ws[122] = "😱"
rs[122] = "خير خوفتني 😨"

ws[124] = "بيش ساعة"
rs[124] = "ما اعرف 🌚🍃"

ws[125] = "🚶🏻"
rs[125] = "خير 🌝"

ws[126] = "منو اكثر واحد تحبه"
rs[126] = "خالتك"

ws[127] = "ليش"
rs[127] = "تاكل خرة الجيش 😂😂"

ws[128] = "طاسه"
rs[128] = "امك حلوة ورقاصه 💃🏻"

ws[129] = "عشرين"
rs[129] = "تاكل جدر خنين 😫"

ws[130] = "ميه"
rs[130] = "😂تشرب مميه"

ws[131] = "اربعة"
rs[131] = "😂لحيه ابوك مربعه"

ws[132] = "فارة"
rs[132] = "😂دفترك كله صفارة"

ws[133] = "ميتين"
rs[133] = "😂فوك راسك قندرتين"

ws[134] = "مات"
rs[134] = "ابو الحمامات 🐦"

ws[135] = "توفه"
rs[135] = "ابو اللفه 🌯"

ws[136] = "احترك"
rs[136] = "🍾البو العرك"

ws[137] = "غرك"
rs[137] = "ابو العرك 🍾"

ws[138] = "طار"
rs[138] = "ابن الطيار"

ws[139] = "ديسحك"
rs[139] = "😂😂 هاي بعده"

ws[140] = "لتسحك"
rs[140] = "😐😂 وك"

ws[141] = "اندرويد"
rs[141] = "افشل نظام بلعالم 🌝🍷"

ws[143] = "ايفون"
rs[143] = "فديتك اته والايفون 🌚🔥"

ws[144] = "كلكسي"
rs[144] = "فاشل اخرة نوع تلفون🔥☹"

ws[145] = "سامسونك"
rs[145] = "فاشل اخرة نوع تلفون🔥☹"

ws[146] = "السادس"
rs[146] = "وكل والله السادس دين ما خله براسي 🙁😔"

ws[147] = "حاته"
rs[147] = "زاحف 😂 منو هاي دزلي صورتهه"


ws[149] = "صاكه"
rs[149] = "زاحف 😂 منو هاي دزلي صورتهه"

ws[150] = "صاك"
rs[150] = "زاحفه 😂 منو هذا دزيلي صورهه"

ws[151] = "منو اني"
rs[151] = "انته احلى شي بحياتي ❤️🍃"

ws[152] = "ابن الكلب"
rs[152] = "عيب ابني 🔥☹"

ws[153] = "انجب انته"
rs[153] = "وك وك 😭😔"

ws[154] = "حطردك"
rs[154] = "اعصابك 😨 لتتهور"

ws[155] = "@Abbas9_9"
rs[155] = "شتريد من المطور 😐🍃"

ws[156] = "منو اكثر واحد تكرهه"
rs[156] = "انته"

ws[157] = "شباب"
rs[157] = "نعم حبي 🌝❤️"

ws[158] = "انته زلمه"
rs[158] = "تعال لزمه 😐😂"

ws[159] = "الاحد"
rs[159] = "هذا اليوم نحس بلنسبه الي"

ws[160] = "الاثنين"
rs[160] = "يوم اجة بي ناس عزيزين وفقدت بي ناس هم ☹"


ws[162] = "اختك"
rs[162] = "شبيهه 😱"

ws[163] = "كواد"
rs[163] = "عيب 😨😨"

ws[164] = "😌"
rs[164] = "المطلوب ؟"


ws[166] = "مرحبا"
rs[166] = "مرحبتين 😍🍃"

ws[167] = "سلام"
rs[167] = "السلام عليكم 🌝🍃"

ws[168] = "السلام"
rs[168] = "السلام عليكم 🌝🍃"

ws[169] = "السلام عليكم"
rs[169] = "عليكم السلام 🌝🍃"

ws[170] = "تسلم"
rs[170] = "الله يسلمك 😍"

ws[171] = "تسلملي"
rs[171] = "ولو ربي يسلمك/ج 😉😍"

ws[172] = "شكد عمرك"
rs[172] = "زاحفه 😂😂"

ws[173] = "هههه"
rs[173] = " دوم حبي ❤️"

ws[174] = "ههههه"
rs[174] = " دوم حبي ❤️"

ws[175] = "داعش"
rs[175] = "اويلي الله هذول كفار 😒❤️"

ws[176] = "الدولة الاسلامية"
rs[176] = "انته داعشي ؟؟ 😒💔"

ws[177] = "سني"
rs[177] = "  فديته اختي الشيعيه🖐"

ws[178] = "شيعي"
rs[178] = "  فديته اختي السنيه"

ws[179] = "تبادل"
rs[179] = "كافي ملينه 😒😒 ما اريد اتبادل"

ws[180] = "العراقيين"
rs[180] = "احلى ناس ولله 😍🙈"

ws[181] = "من وين"
rs[181] = "شعليك زاحف 😂🔥 "

ws[182] = "تركيا"
rs[182] = "😐🍃 فديتهه"

ws[183] = "شغل المبردة"
rs[183] = " تم تشغيل المبردة بنجاح ❄️"

ws[184] = "طفي المبردة"
rs[184] = "طفيتهه 😒🍃"

ws[185] = "شغل السبلت"
rs[185] = "شغلته 🌚🍃 بس حثلجون معليه ترا " 

ws[186] = "بطريق"
rs[186] = " 😕💔 نعم حبي "

ws[187] = "الناصريه"
rs[187] = "🍃💋 فديتهه والله احله ناس اعرفتهم بيه💋😘"

ws[188] = "الرفاعي"
rs[188] = "حضي المصخم شمرني بيه وانقبلت 😒بسومر😕😔 "

ws[189] = "سوق الشيوخ"
rs[189] = "🍃💋 اويلي تقصد الاصاله والشرف والكرم ؟؟💋😘"

ws[190] = "شارع فلسطين"
rs[190] = " احسن ناس وربي❤️"

ws[191] = "نوه"
rs[191] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️"

ws[192] = "عقيل"
rs[192] = "اهوو هذا المتدين مال غرفة رقم 3"

ws[193] = "وردة"
rs[193] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️ �😻"

ws[194] = "هدهد"
rs[194] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️ �😻"

ws[195] = "فرح"
rs[195] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �😻"

ws[196] = "انور" 
rs[196] ="اخـہـخ 😨 صـہـاكك اڵـہـكڕۆب هذا 🏻️  �😻"

ws[197] = "عبوسي"
rs[197] ="فديت ربه اشكد احبة 💋😍😘"

ws[198] = "علوش"
rs[198] ="منو تقصد الزاحف 🐍😂"

ws[199] = "Abbas"
rs[199] ="فديته هذا المطور مالتي💋😍💋"

ws[200] = "عقيل" 
rs[200] ="اخـہـخ 😨 صـہـاكك اڵـہـكڕۆب هذا 🏻️  �😻"

ws[201] = "علي سالم رضا"
rs[201] ="اخـہـخ 😨 صـہـاكك اڵـہـكڕۆب هذا 🏻️  �😻"

ws[202] = "الله وكيلك هذه البوت ناجاني نيج"
rs[202] ="انجب لك زاحف😡"

ws[203] = "اسو"
rs[203] ="فدييت ربه 💋😘😍"

ws[204] = "الفهود"
rs[204] ="اااخ هذوله عمامنه فديتهم 💋😘😍"

ws[205] = "الشطره"
rs[205] ="فديييت ربه💋😘😍"

ws[206] = "النجف"
rs[206] ="🙈انسابتنه شعدنه غيرهم 💋😍"

-- the main function
function run( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      --send_large_msg ( R , rs[i] ); 
      --send_reply(msg.id, rs[i]) 
      reply_msg(msg.id, rs[i], ok_cb, false ) 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "li_xXx_il" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "Made by @li_xXx_il" ); 
      end 
   end 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = run 
} 

end
-----لا تمسح الحقوق ياعار غيرك تعبان على الملفات -------
--------------------عباس السعيدي-----------------------
--------------------Dev@Abbas9_9-----------------------